# Задача 2. Да се състави програма, която ще изчисли сумата на 5, въведени от
# клавиатурата, естествени числа от интервала [10 ..5555].
# Вход: 1,2,3,4,5
# Изход: 15

sum = 0
for i in range(5) :
    try :
        x= int(input(f'Въведете {i+1} естествено число в интервала [10 ..5555]='))
        if x < 10 or x > 5555 :
            raise()
    except :
        print('Въвели сте некоректна стойност за числото или такава извън интервала [10 ..5555]')
        exit()
    sum = sum + x
print(f'Сумата на числата е {sum}')