# Задача 4. Да се напише програма, която да обръща буквите на дадена дума на обратно.
# Думата да бъде въведена от клавиатурата. Като за целта използвате цикъл.
# Вход:
# Input a word to reverse: Hello
# Изход:
# olleH

Word = input('Въведете дума от клавиатурата - ')
# print(len(Word))
for i in range(len(Word), 0 , -1) :
    print(Word[i-1], sep='', end='') # Разпечатваме буквите започвайки от последната към първата