# Задача 10. Да се състави програма, която изчислява сумата на произведенията от 1 до
# въведено едноцифрено число.
# Сумата се формира така:
# 1*2 + 2*3*4 +..+n*(n+1)*(n+2)*..*2*n
# Вход: 4
# Изход: 7106

while True :
    input_nomber = int(input('въведете едноцифрено число от 1 до 9 ='))
    print(f'Входното число е {input_nomber}')
    if input_nomber < 9 and input_nomber > 1 :
        break

product=1 # в тази променлива запомняма произведенията на числата от вътрешния цикъл while т.е произведенията на числата от списъка Proizvedenie
sum = 0
Proizvedenie = [] # създавем празен списък
j = 1

# цикъл за групите числа от функцията
for i in range(1, input_nomber+1) : 
    j = i
# цикъл за пресмятане на числата в една група от функцията и записването им в списъка Proizvedenie
    while (j != (2*i)+1) :  # проверяваме брояча дали е стигнал числото 2*n -изчисляваме всяка група от формулата n*(n+1)*(n+2)*..*2*n
        # print(f'Брояча j = {j}')
        Proizvedenie.append(j) # добавяме в списъка всяко изчислено число според функцията
        # print(f'произведението е  = {Proizvedenie}')
        j = j + 1
        # print(f'j e = {j}')
    for x in range(len(Proizvedenie)) : # след като сме изчислили всички числа в една група записани в списъка Proizvedenie пресмятаме тяхното прозведение в product
        product = product*Proizvedenie[x]
    # print(f'произведението на числата от 1 цикъл е = {product}')
    
    sum = sum + product # събираме числата от различните групи на функцията
    product = 1 
    # print(f'дължината на списъка е {x}')
    Proizvedenie = []  # изчистваме списъка Proizvedenie
    # j = i
    # print(f'{i} цикъл')

print(f'Сумата от произведенията от на отделните групи от функцията е = {sum}')