# Задача 6. Да се напише програма, която да принтира всички числа от 0 до 6, без да
# включва 3 и 6.
# Изход: 0 1 2 4 5

for i in range(7) :
    if i==3 or i==6 :# проверка дали числата са 3 и 6 за тях прескача разпечатването на числото 
        continue
    print(i, sep= '', end=' ') # останалите числа ги разпечатва