# Задача 16. Да се създаде програма, която да въвежда текст от клавиатурата и да
# премахва повтарящите се букви в текста.
# Вход: aaabbbccc
# Изход: abc

Text = input('Въведете произволен текст от клавиатурата с повтарящи се символи = ')

New_Text=''

# Цикъл за проверка на всички символи в низа за еднаквост на съседните символи 
for i in range(len(Text)) : # ако символа е първия или следващия е различен от предходния да се добавят в новия низ
    if (i == 0 or Text[i] != Text[i-1]) : 
        New_Text = New_Text+Text[i]

print(New_Text)
